Revit 2026 API
DirectShape.IsValidShape Method
Overload List
Name | Description
IsValidShape(ExternallyTaggedGeometryObject) |  Validates shape to be stored in a DirectShape.
IsValidShape(IList<GeometryObject>)
IsValidShape(IList<GeometryObject>, DirectShapeTargetViewType)
Top
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace